tap "homebrew/cask"
tap "microsoft/git"
cask_args appdir: "~/Applications", require_sha: true

# Some inspiration from https://github.com/driesvints/dotfiles/blob/main/Brewfile
# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'

# Development
brew 'php@7.4'
brew 'composer'

# Apps
cask 'adobe-acrobat-reader'
cask 'adobe-creative-cloud'
cask 'karabiner-elements'
cask 'firefox'
cask 'git-credential-manager-core'
cask "google-chrome", args: { require_sha: false }
cask "iterm2"
cask "microsoft-office"
cask "rectangle"
cask 'slack'
cask "spotify", args: { require_sha: false }
cask "visual-studio-code"
cask 'zoom'

# TODO: To learn about
# cask 'ray'